In [20]:
import pandas as pd
import numpy as np

In [21]:
df = pd.read_csv('./estudiantes.csv')
print(df)
# Este ejemplo ya lo convertimos desde el propio excel

     NOMBRE  EDAD GENERO      CARRERA  SEMESTRE
0      Luis    45      M     Auditoria  Primero
1     Luisa    42      F   Informatica  Primero
2       Leo    15      M       Derecho   Quinto
3   Marcela    35      F   Informatica  Septimo
4    Andres    24      M       Derecho  Tercero
5       Ana    65      F  Arquitectura  Septimo
6  Fernanda    12      F   Infromatica  Primero
7     David    45      M      Economia   Noveno

Pasamos de Excel a Csv

In [24]:
# Pasar de excel a csv
convertir = pd.read_excel('./estudiantes.xlsx')  # Leemos el archivo

In [25]:
# Pasamos el archivo a csv
convertir.to_csv('./estudiantesDos.csv', index=None, header=True)

Usamos el archivo convertido.

In [26]:
dfConvertido = pd.read_csv('./estudiantesDos.csv')
dfConvertido

     NOMBRE  EDAD GENERO      CARRERA  SEMESTRE
0      Luis    45      M     Auditoria  Primero
1     Luisa    42      F   Informatica  Primero
2       Leo    15      M       Derecho   Quinto
3   Marcela    35      F   Informatica  Septimo
4    Andres    24      M       Derecho  Tercero
5       Ana    65      F  Arquitectura  Septimo
6  Fernanda    12      F   Infromatica  Primero
7     David    45      M      Economia   Noveno